In [ ]:
# pandas, data maipulation , analysis, monitoring, very usefull in evry day, and very useful

In [35]:
import pandas as pd

In [36]:
data = {'name':['sudh', 'krish', 'hitesh', 'tulusko'], 'salary':[100,200,300,400],
        'mail_id':['sudh@ineuron.ai', 'krish.ineuron.ai', 'hitesh.ineuron.ai','telusko.ineuron.ai'],
        'adress':['blr','kalb','bang', 'bankok',]
}

In [17]:
data

{'name': ['sudh', 'krish', 'hitesh', 'tulusko'],
 'salary': [100, 200, 300, 400],
 'mail_id': ['sudh@ineuron.ai',
  'krish.ineuron.ai',
  'hitesh.ineuron.ai',
  'telusko.ineuron.ai'],
 'adress': ['blr', 'kalb', 'bang', 'bankok']}

In [39]:
# convert dictionary into data frame formate
df= pd.DataFrame(data)
df

      name  salary             mail_id  adress
0     sudh     100     sudh@ineuron.ai     blr
1    krish     200    krish.ineuron.ai    kalb
2   hitesh     300   hitesh.ineuron.ai    bang
3  tulusko     400  telusko.ineuron.ai  bankok

In [21]:
pd.DataFrame(data, columns= [0,1,2,3])  # adding own column

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [24]:
df =pd.DataFrame(data, index=[4,5,6,7])  # giving own index name

In [25]:
df

      name  salary             mail_id  adress
4     sudh     100     sudh@ineuron.ai     blr
5    krish     200    krish.ineuron.ai    kalb
6   hitesh     300   hitesh.ineuron.ai    bang
7  tulusko     400  telusko.ineuron.ai  bankok

In [27]:
df.loc[5:6]

     name  salary            mail_id adress
5   krish     200   krish.ineuron.ai   kalb
6  hitesh     300  hitesh.ineuron.ai   bang

In [29]:
df.iloc[5:6]    # it wonts give data because it work on only default index hear we have assigned index manuay 4 to 7

Empty DataFrame
Columns: [name, salary, mail_id, adress]
Index: []

In [42]:
df.iloc[0:4]   # 0 to 3 are default index

      name  salary             mail_id  adress
4     sudh     100     sudh@ineuron.ai     blr
5    krish     200    krish.ineuron.ai    kalb
6   hitesh     300   hitesh.ineuron.ai    bang
7  tulusko     400  telusko.ineuron.ai  bankok

In [65]:
df = pd.DataFrame(data, index=['such', 'krish','hitesh', 'telusko'])

In [66]:
df

            name  salary             mail_id  adress
such        sudh     100     sudh@ineuron.ai     blr
krish      krish     200    krish.ineuron.ai    kalb
hitesh    hitesh     300   hitesh.ineuron.ai    bang
telusko  tulusko     400  telusko.ineuron.ai  bankok

In [69]:
df = pd.DataFrame(data)

In [70]:
df

      name  salary             mail_id  adress
0     sudh     100     sudh@ineuron.ai     blr
1    krish     200    krish.ineuron.ai    kalb
2   hitesh     300   hitesh.ineuron.ai    bang
3  tulusko     400  telusko.ineuron.ai  bankok

In [71]:
df[1:3]

     name  salary            mail_id adress
1   krish     200   krish.ineuron.ai   kalb
2  hitesh     300  hitesh.ineuron.ai   bang

In [76]:
data1 = {'pf_nu': [235,542,225,56],
         'income_tac':[25464,56541,65523, 65523],
         'mobile_no':[25642,362254,3266,2362],
         'course': ['ds','bigdata','web dev', 'blockchain']
        
        }

In [77]:
df1 = pd.DataFrame(data1)

In [74]:
df1

{'pf_nu': [235, 542, 225, 56],
 'income_tac': [25464, 56541, 65523],
 'mobile_no': [25642, 362254, 3266, 2362],
 'course': ['ds', 'bigdata', 'web dev', 'blockchain']}

In [78]:
df1

   pf_nu  income_tac  mobile_no      course
0    235       25464      25642          ds
1    542       56541     362254     bigdata
2    225       65523       3266     web dev
3     56       65523       2362  blockchain

In [79]:
df

      name  salary             mail_id  adress
0     sudh     100     sudh@ineuron.ai     blr
1    krish     200    krish.ineuron.ai    kalb
2   hitesh     300   hitesh.ineuron.ai    bang
3  tulusko     400  telusko.ineuron.ai  bankok

In [ ]:
# perform concatination operation,   
can merge it in harizontally and vartically
1, string

In [81]:
pd.concat([df,df1])   # it has done a vartical concat, sice axis= 0 by default

,name,salary,mail_id,adress,pf_nu,income_tac,mobile_no,course
0,sudh,100.0,sudh@ineuron.ai,blr,NaN,NaN,NaN,NaN
1,krish,200.0,krish.ineuron.ai,kalb,NaN,NaN,NaN,NaN
2,hitesh,300.0,hitesh.ineuron.ai,bang,NaN,NaN,NaN,NaN
3,tulusko,400.0,telusko.ineuron.ai,bankok,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,NaN,235.0,25464.0,25642.0,ds
1,NaN,NaN,NaN,NaN,542.0,56541.0,362254.0,bigdata
2,NaN,NaN,NaN,NaN,225.0,65523.0,3266.0,web dev
3,NaN,NaN,NaN,NaN,56.0,65523.0,2362.0,blockchain

In [82]:
pd.concat([df,df1], axis = 1)  #it has done a horizon concat, sice axis= 1t

,name,salary,mail_id,adress,pf_nu,income_tac,mobile_no,course
0,sudh,100,sudh@ineuron.ai,blr,235,25464,25642,ds
1,krish,200,krish.ineuron.ai,kalb,542,56541,362254,bigdata
2,hitesh,300,hitesh.ineuron.ai,bang,225,65523,3266,web dev
3,tulusko,400,telusko.ineuron.ai,bankok,56,65523,2362,blockchain

In [85]:
data2 = {'0':['sudh', 'krish', 'hitesh', 'tulusko'], '1':[100,200,300,400],
        '2':['sudh@ineuron.ai', 'krish.ineuron.ai', 'hitesh.ineuron.ai','telusko.ineuron.ai'],
        '3':['blr','kalb','bang', 'bankok',]
}

In [94]:
data3 = {'0': [235,542,225,56],
         '1':[25464,56541,65523, 65523],
         '2':[25642,362254,3266,2362],
         '3': ['ds','bigdata','web dev', 'blockchain']
        
        }

In [95]:
df2 = pd.DataFrame(data2)

In [96]:
df3 = pd.DataFrame(data3)

In [97]:
df2

         0    1                   2       3
0     sudh  100     sudh@ineuron.ai     blr
1    krish  200    krish.ineuron.ai    kalb
2   hitesh  300   hitesh.ineuron.ai    bang
3  tulusko  400  telusko.ineuron.ai  bankok

In [98]:
df3

     0      1       2           3
0  235  25464   25642          ds
1  542  56541  362254     bigdata
2  225  65523    3266     web dev
3   56  65523    2362  blockchain

In [99]:
pd.concat([df2,df3])   # verticle concat since both data column name is same

         0      1                   2           3
0     sudh    100     sudh@ineuron.ai         blr
1    krish    200    krish.ineuron.ai        kalb
2   hitesh    300   hitesh.ineuron.ai        bang
3  tulusko    400  telusko.ineuron.ai      bankok
0      235  25464               25642          ds
1      542  56541              362254     bigdata
2      225  65523                3266     web dev
3       56  65523                2362  blockchain

In [100]:
# merge operaation

In [132]:
data4 = {'emp_id':[101,102,103,104],
         'salary':[345,432,445,332],
         'pf':[23,43,23,45]
        }

In [133]:
data5 = {'emp_id':[101,102,104,105],
         'mob_no':[3562,6552,2255,5546],
         'house_no':[656,264,2663,456]
        }

In [116]:
df4= pd.DataFrame(data4)

In [121]:
type(df4)

pandas.core.frame.DataFrame

In [122]:
df4

   emp_id  salary  pf
0     101     345  23
1     102     432  43
2     103     445  23
3     104     332  45

In [118]:
df5 = pd.DataFrame(data5)

In [123]:
type(df5)

pandas.core.frame.DataFrame

In [124]:
df4

   emp_id  salary  pf
0     101     345  23
1     102     432  43
2     103     445  23
3     104     332  45

In [125]:
df5

   emp_id  mob_no  house_no
0     101    3562       656
1     102    6552       264
2     104    2255      2663
3     105    5546       456

In [ ]:
#df4 and df5 has a relation of emp_id can perform merge operation

In [126]:
pd.merge(df4,df5)  # merge

   emp_id  salary  pf  mob_no  house_no
0     101     345  23    3562       656
1     102     432  43    6552       264
2     104     332  45    2255      2663

In [127]:
pd.merge(df4,df5,  how= 'left')   # df4 is left

   emp_id  salary  pf  mob_no  house_no
0     101     345  23  3562.0     656.0
1     102     432  43  6552.0     264.0
2     103     445  23     NaN       NaN
3     104     332  45  2255.0    2663.0

In [128]:
pd.merge(df4,df5,  how= 'right')    # df5 is right

   emp_id  salary    pf  mob_no  house_no
0     101   345.0  23.0    3562       656
1     102   432.0  43.0    6552       264
2     104   332.0  45.0    2255      2663
3     105     NaN   NaN    5546       456

In [129]:
pd.merge(df4,df5,  how= 'right', on = 'emp_id')

   emp_id  salary    pf  mob_no  house_no
0     101   345.0  23.0    3562       656
1     102   432.0  43.0    6552       264
2     104   332.0  45.0    2255      2663
3     105     NaN   NaN    5546       456

In [134]:
data6 = {'emp_id1':[101,102,103,104],
         'salary':[345,432,445,332],
         'pf':[23,43,23,45]
        }

data7 = {'emp_id2':[101,102,104,105],
         'mob_no':[3562,6552,2255,5546],
         'house_no':[656,264,2663,456]
        }

In [135]:
df6 = pd.DataFrame(data6)

In [136]:
df7 = pd.DataFrame(data7)

In [137]:
df6

   emp_id1  salary  pf
0      101     345  23
1      102     432  43
2      103     445  23
3      104     332  45

In [138]:
df7

   emp_id2  mob_no  house_no
0      101    3562       656
1      102    6552       264
2      104    2255      2663
3      105    5546       456

In [ ]:
# sicne we dont hae common  column form both  df, 6 and 7
lets try to perform merge operation

In [140]:
pd.merge(df6,df7, left_on= 'emp_id1', right_on='emp_id2' )  # value of how is default 'inner'

   emp_id1  salary  pf  emp_id2  mob_no  house_no
0      101     345  23      101    3562       656
1      102     432  43      102    6552       264
2      104     332  45      104    2255      2663

In [ ]:
# always merge and join operation basd on key values comparison if matching it peform, inner, left & right

In [147]:
data8 = {'emp_id':[101,102,103,104],
         'salary':[345,432,445,332],
         'pf':[23,43,23,45]
        }

data9 = {'emp_id':[101,102,104,105],
         'salary':[345,432,445,5546],
         'house_no':[656,264,2663,456]
        }

In [148]:
df8 = pd.DataFrame(data8)

In [149]:
df9 = pd.DataFrame(data9)

In [150]:
df8

   emp_id  salary  pf
0     101     345  23
1     102     432  43
2     103     445  23
3     104     332  45

In [151]:
df9

   emp_id  salary  house_no
0     101     345       656
1     102     432       264
2     104     445      2663
3     105    5546       456

In [156]:
pd.merge(df8,df9 , on = ['emp_id', 'salary'] )

   emp_id  salary  pf  house_no
0     101     345  23       656
1     102     432  43       264

In [157]:
pd.merge(df8,df9 , on = ['emp_id', 'salary'], how = 'right' )

   emp_id  salary    pf  house_no
0     101     345  23.0       656
1     102     432  43.0       264
2     104     445   NaN      2663
3     105    5546   NaN       456

In [158]:
pd.merge(df8,df9 , on = ['emp_id', 'salary'], how = 'left' )

   emp_id  salary  pf  house_no
0     101     345  23     656.0
1     102     432  43     264.0
2     103     445  23       NaN
3     104     332  45       NaN

In [159]:
# join operation

In [178]:
data10 = {'emp_id1':[101,102,103,104],
         'salary1':[345,432,445,332],
         'pf':[23,43,23,45]
        }

data11 = {'emp_id2':[101,102,104,105,123],
         'salary2':[345,432,445,5546,43],
         'house_no':[656,264,2663,456,234]
        }

In [179]:
df10 = pd.DataFrame(data10, index= ['a','b','c','d'])

In [180]:
df11 = pd.DataFrame(data11, index= ['a','b','d','e','f'])

In [181]:
df10

   emp_id1  salary1  pf
a      101      345  23
b      102      432  43
c      103      445  23
d      104      332  45

In [182]:
df11

   emp_id2  salary2  house_no
a      101      345       656
b      102      432       264
d      104      445      2663
e      105     5546       456
f      123       43       234

In [183]:
df10.join(df11)   
#join is similar to merge, diff, mrge perform baed  by matching same column name
# join perform based on row index matching

   emp_id1  salary1  pf  emp_id2  salary2  house_no
a      101      345  23    101.0    345.0     656.0
b      102      432  43    102.0    432.0     264.0
c      103      445  23      NaN      NaN       NaN
d      104      332  45    104.0    445.0    2663.0

In [186]:
df_sales = pd.read_csv(r'C:\Users\User\Downloads\sales_data_final.csv')

In [187]:
df_sales.head()

,order_id,order_date,ship_date,ship_mode,customer_name,segment,state,country,market,region,...,category,sub_category,product_name,sales,quantity,discount,profit,shipping_cost,order_priority,year
0,AG-2011-2040,1/1/2011,1/6/2011,Standard Class,Toby Braunhardt,Consumer,Constantine,Algeria,Africa,Africa,...,Office Supplies,Storage,"Tenex Lockers, Blue",408,2,0.0,106.140,35.46,Medium,2011
1,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,Office Supplies,Supplies,"Acme Trimmer, High Speed",120,3,0.1,36.036,9.72,Medium,2011
2,HU-2011-1220,1/1/2011,1/5/2011,Second Class,Annie Thurman,Consumer,Budapest,Hungary,EMEA,EMEA,...,Office Supplies,Storage,"Tenex Box, Single Width",66,4,0.0,29.640,8.17,High,2011
3,IT-2011-3647632,1/1/2011,1/5/2011,Second Class,Eugene Moren,Home Office,Stockholm,Sweden,EU,North,...,Office Supplies,Paper,"Enermax Note Cards, Premium",45,3,0.5,-26.055,4.82,High,2011
4,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,Furniture,Furnishings,"Eldon Light Bulb, Duo Pack",114,5,0.1,37.770,4.70,Medium,2011

In [203]:
def profit_flag(a):
    if a > 0:
        return 'positive'
    elif a ==0:
        return 'Zero'
    else:
        return 'negative'

In [204]:
profit_flag(10)

'positive'

In [205]:
profit_flag(-10)

'negative'

In [206]:
profit_flag(0)

'Zero'

In [209]:
df_sales['flag_profit']= df_sales['profit'].apply(profit_flag)

In [210]:
df_sales.head()

,order_id,order_date,ship_date,ship_mode,customer_name,segment,state,country,market,region,...,sub_category,product_name,sales,quantity,discount,profit,shipping_cost,order_priority,year,flag_profit
0,AG-2011-2040,1/1/2011,1/6/2011,Standard Class,Toby Braunhardt,Consumer,Constantine,Algeria,Africa,Africa,...,Storage,"Tenex Lockers, Blue",408,2,0.0,106.140,35.46,Medium,2011,positive
1,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,Supplies,"Acme Trimmer, High Speed",120,3,0.1,36.036,9.72,Medium,2011,positive
2,HU-2011-1220,1/1/2011,1/5/2011,Second Class,Annie Thurman,Consumer,Budapest,Hungary,EMEA,EMEA,...,Storage,"Tenex Box, Single Width",66,4,0.0,29.640,8.17,High,2011,positive
3,IT-2011-3647632,1/1/2011,1/5/2011,Second Class,Eugene Moren,Home Office,Stockholm,Sweden,EU,North,...,Paper,"Enermax Note Cards, Premium",45,3,0.5,-26.055,4.82,High,2011,negative
4,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,Furnishings,"Eldon Light Bulb, Duo Pack",114,5,0.1,37.770,4.70,Medium,2011,positive

In [212]:
df_sales['len_cust_name']= df_sales['customer_name'].apply(len)

In [213]:
df_sales.head()

,order_id,order_date,ship_date,ship_mode,customer_name,segment,state,country,market,region,...,product_name,sales,quantity,discount,profit,shipping_cost,order_priority,year,flag_profit,len_cust_name
0,AG-2011-2040,1/1/2011,1/6/2011,Standard Class,Toby Braunhardt,Consumer,Constantine,Algeria,Africa,Africa,...,"Tenex Lockers, Blue",408,2,0.0,106.140,35.46,Medium,2011,positive,15
1,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,"Acme Trimmer, High Speed",120,3,0.1,36.036,9.72,Medium,2011,positive,11
2,HU-2011-1220,1/1/2011,1/5/2011,Second Class,Annie Thurman,Consumer,Budapest,Hungary,EMEA,EMEA,...,"Tenex Box, Single Width",66,4,0.0,29.640,8.17,High,2011,positive,13
3,IT-2011-3647632,1/1/2011,1/5/2011,Second Class,Eugene Moren,Home Office,Stockholm,Sweden,EU,North,...,"Enermax Note Cards, Premium",45,3,0.5,-26.055,4.82,High,2011,negative,12
4,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,"Eldon Light Bulb, Duo Pack",114,5,0.1,37.770,4.70,Medium,2011,positive,11

In [218]:
def quantity_flag(a):
    if a <10 :
        return 'low'
    elif a > 10 and a< 20:
        return 'medium'
    else:
        return 'High'

In [219]:
df_sales['flag_quntity']= df_sales['quantity'].apply(quantity_flag)

In [220]:
df_sales.head()

,order_id,order_date,ship_date,ship_mode,customer_name,segment,state,country,market,region,...,sales,quantity,discount,profit,shipping_cost,order_priority,year,flag_profit,len_cust_name,flag_quntity
0,AG-2011-2040,1/1/2011,1/6/2011,Standard Class,Toby Braunhardt,Consumer,Constantine,Algeria,Africa,Africa,...,408,2,0.0,106.140,35.46,Medium,2011,positive,15,low
1,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,120,3,0.1,36.036,9.72,Medium,2011,positive,11,low
2,HU-2011-1220,1/1/2011,1/5/2011,Second Class,Annie Thurman,Consumer,Budapest,Hungary,EMEA,EMEA,...,66,4,0.0,29.640,8.17,High,2011,positive,13,low
3,IT-2011-3647632,1/1/2011,1/5/2011,Second Class,Eugene Moren,Home Office,Stockholm,Sweden,EU,North,...,45,3,0.5,-26.055,4.82,High,2011,negative,12,low
4,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,114,5,0.1,37.770,4.70,Medium,2011,positive,11,low

In [221]:
df_sales

,order_id,order_date,ship_date,ship_mode,customer_name,segment,state,country,market,region,...,sales,quantity,discount,profit,shipping_cost,order_priority,year,flag_profit,len_cust_name,flag_quntity
0,AG-2011-2040,1/1/2011,1/6/2011,Standard Class,Toby Braunhardt,Consumer,Constantine,Algeria,Africa,Africa,...,408,2,0.0,106.1400,35.46,Medium,2011,positive,15,low
1,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,120,3,0.1,36.0360,9.72,Medium,2011,positive,11,low
2,HU-2011-1220,1/1/2011,1/5/2011,Second Class,Annie Thurman,Consumer,Budapest,Hungary,EMEA,EMEA,...,66,4,0.0,29.6400,8.17,High,2011,positive,13,low
3,IT-2011-3647632,1/1/2011,1/5/2011,Second Class,Eugene Moren,Home Office,Stockholm,Sweden,EU,North,...,45,3,0.5,-26.0550,4.82,High,2011,negative,12,low
4,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,114,5,0.1,37.7700,4.70,Medium,2011,positive,11,low
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
51285,CA-2014-115427,12/31/2014,1/4/2015,Standard Class,Erica Bern,Corporate,California,United States,US,West,...,14,2,0.2,4.5188,0.89,Medium,2014,positive,10,low
51286,MO-2014-2560,12/31/2014,1/5/2015,Standard Class,Liz Preis,Consumer,Souss-Massa-Dra,Morocco,Africa,Africa,...,4,1,0.0,0.4200,0.49,Medium,2014,positive,9,low
51287,MX-2014-110527,12/31/2014,1/2/2015,Second Class,Charlotte Melton,Consumer,Managua,Nicaragua,LATAM,Central,...,26,3,0.0,12.3600,0.35,Medium,2014,positive,16,low
51288,MX-2014-114783,12/31/2014,1/6/2015,Standard Class,Tamara Dahlen,Consumer,Chihuahua,Mexico,LATAM,North,...,7,1,0.0,0.5600,0.20,Medium,2014,positive,13,low
51289,CA-2014-156720,12/31/2014,1/4/2015,Standard Class,Jill Matthias,Consumer,Colorado,United States,US,West,...,3,3,0.2,-0.6048,0.17,Medium,2014,negative,13,low

In [222]:
df_sales['square_quantity'] = df_sales['quantity'].apply(lambda a : a**2)

In [225]:
df_sales.head()

,order_id,order_date,ship_date,ship_mode,customer_name,segment,state,country,market,region,...,quantity,discount,profit,shipping_cost,order_priority,year,flag_profit,len_cust_name,flag_quntity,square_quantity
0,AG-2011-2040,1/1/2011,1/6/2011,Standard Class,Toby Braunhardt,Consumer,Constantine,Algeria,Africa,Africa,...,2,0.0,106.140,35.46,Medium,2011,positive,15,low,4
1,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,3,0.1,36.036,9.72,Medium,2011,positive,11,low,9
2,HU-2011-1220,1/1/2011,1/5/2011,Second Class,Annie Thurman,Consumer,Budapest,Hungary,EMEA,EMEA,...,4,0.0,29.640,8.17,High,2011,positive,13,low,16
3,IT-2011-3647632,1/1/2011,1/5/2011,Second Class,Eugene Moren,Home Office,Stockholm,Sweden,EU,North,...,3,0.5,-26.055,4.82,High,2011,negative,12,low,9
4,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,5,0.1,37.770,4.70,Medium,2011,positive,11,low,25

In [ ]:
#explaratry data analysis(EDA), numpy, matlotlib,pandas, all this v imp for data manipulation

# numpy

In [13]:
import pandas as pd
import numpy as np
import cufflinks as cf

In [8]:
cf.go_offline()

In [2]:
np.array([1,2,3,4])

array([1, 2, 3, 4])

In [3]:
type(np.array([1,2,3,4]))

numpy.ndarray

In [4]:
np.array([[1,2,3],[4,5,6]])

array([[1, 2, 3],
       [4, 5, 6]])

In [5]:
type(np.array([[1,2,3],[4,5,6]]))

numpy.ndarray

In [6]:
np.array([[1,2,3,4],[2,3,4,5]])

array([[1, 2, 3, 4],
       [2, 3, 4, 5]])

In [10]:
l = [[1,2,3,4]]

In [9]:
l[0][0]

1

In [13]:
a  = np.array([1,2,3,4])

In [17]:
a  = np.array([3,4,5,6], ndmin= 3)

In [18]:
a

array([[[3, 4, 5, 6]]])

In [20]:
arr = np.array([[1,2,3],[4,5,6],[7,8,9]])

In [24]:
arr.ndim

2

In [27]:
a.ndim

3

In [28]:
# to create data in numpy there are multiple function availabe

In [31]:
np.random.randint(1,10,(4,4))     # 4x4, 2 dim array

array([[4, 7, 1, 8],
       [7, 9, 3, 6],
       [4, 6, 8, 3],
       [9, 7, 6, 5]])

In [15]:
np.random.randint(1,10,(4,4,2))  # 3 dim array, we have 4x2 matrix with 4 layers(Z,Y,X), (1:10(b/w this it will pik numbers))

array([[[8, 4],
        [6, 5],
        [1, 4],
        [1, 6]],

       [[4, 9],
        [1, 5],
        [4, 4],
        [2, 8]],

       [[1, 7],
        [3, 9],
        [6, 8],
        [1, 7]],

       [[3, 6],
        [4, 5],
        [8, 6],
        [6, 9]]])

In [19]:
df = pd.DataFrame(np.random.randint(1,10,(4,2)), columns=['a', 'b'])   # import to dataframe formate

In [20]:
df

   a  b
0  8  9
1  5  7
2  6  5
3  9  8

In [21]:
df.iplot()

In [ ]:
#Task 1 - Fitbit Dataset

1. Read this dataset in pandas , mysql and mongodb 
2. while creting a table in mysql dont use manual approach to create it  ,always use a automation to create a table in mysql
 ## hint - use csvkit library to automate this task and to load a data in bulk in you mysql 
3. convert all the dates avaible in dataset to timestamp format in pandas and in sql you to convert it in date format
4 . Find out in this data that how many unique id's we have 
5 . which id is one of the active id that you have in whole dataset 
6 . how many of them have not logged there activity find out in terms of number of ids 
7 . Find out who is the laziest person id that we have in dataset 
8 . Explore over an internet that how much calories burn is required for a healthy person and find out how many healthy person we have in our dataset 
9. how many person are not a regular person with respect to activity try to find out those 
10 . who is the thired most active person in this dataset find out those in pandas and in sql both . 
11 . who is the 5th most laziest person avilable in dataset find it out 
12 . what is a totla acumulative calories burn for a person find out

In [ ]:
#task 2 - Superstore_USA
1 . load this data in sql and in pandas with a relation in sql 
2 . while loading this data you dont have to create a table manually you can use any automated approach to create a table and load a data in bulk in table 
3 . Find out how return that we ahve recived and with a product id 
4 . try  to join order and return data both in sql and pandas 
5 . Try to find out how many unique customer that we have 
6 . try to find out in how many regions we are selling a product and who is a manager for a respective region 
7 . find out how many different differnet shipement mode that we have and what is a percentage usablity of all the shipment mode with respect to dataset 
8 . Create a new coulmn and try to find our a diffrence between order date and shipment date
9 . base on question number 8 find out for which order id we have shipment duration more than 10 days 
10 . Try to find out a list of a returned order which sihpment duration was more then 15 days and find out that region manager as well 
11 . Gorup by region and find out which region is more profitable 
12 . Try to find out overalll in which country we are giving more didscount 
13 . Give me a list of unique postal code 
14 . which customer segement is more profitalble find it out . 
15 . try to find out the 10th most loss making product catagory . 
16 . Try to find out 10 top  product with highest margins 

submit your git link for the same 
 
you have to submit this task by next Friday 5th 11PM IST  to respective mail id 
sudhanshu@ineuron.ai , sunny.savita@ineuron.ai

fo my ref/pract
Task1: use Fit bit data set


3, convert all the dates available in data set to time formate in and sql you have to convert it in data formate,
4, find out in this data how many unique id we have 
5, which id is one of active id hve 
6, how many of you have 
7, find out who is laziest person id we have in dataset
8, exllre over a inernet that how much calories are burn is required for a  healthy person and find out we ahve in data set
9, how many regular person are not regulae
10 whois third most active eprson iin thid data set 
who is 5 th most active person in this data set 
11, what is total acumulative calories burn fro a person find out


task2: , can uperstore usa

1, load this data in sqland pandas with relation in SQL
2, while loading this dat dont have to creat a table manually, use any automated approach to creat 
3, find out how many retun that we have recieved and with a product id
4, try to join order and return data
5, find out in how many regions we are selling a produt are selling a respective region
7, find out hiw many different shipment mode that we have and what is a percentage usability of alll the segment 
8, creat a new column and try to find out difference between order date and shipment date 

9, find out question number 8 fin find oit for which order id we have shipment duration more thaan 10 
10, try to find out a list of a returned which 
11, Group by region and find out which region is more profitable 
12, try to find out overall in which country we are giving more discount
13, Give me a list of unique postal code
14, tryt o find out the 10th loss making product category
16, try to find out 10 top product

In [ ]:
Dout clearing Session:
    
1, some onefaced issue while reading excell file
solution,
variable = 'excell_file_name_xlsx'
pd.read_excel(variable.strip("\u202a"))

2,

In [40]:
df

      name  salary             mail_id  adress
0     sudh     100     sudh@ineuron.ai     blr
1    krish     200    krish.ineuron.ai    kalb
2   hitesh     300   hitesh.ineuron.ai    bang
3  tulusko     400  telusko.ineuron.ai  bankok

In [58]:
df.groupby('name')

AttributeError: 'SeriesGroupBy' object has no attribute 'avg'

In [ ]:
loading data in sql

use ineuron

select * from sharan2.ineuron
create table sales(





load data into file '‪C:\Users\User\Downloads\sales_data_final.csv' into table sales
fields terminated bt ','
enclosed by '"'
lines terminated by '\n'
ignore 1 row;